<?php

class Constants {

    const DB_SERVER = 'localhost';
    const DB_NAME = 'u0914239_default';
    const DB_USERNAME = 'u0914239_default';
    const DB_PASSWORD = '7iB!kC5f';

    const BOT_TOKEN_DEV = '443210917:AAEgqEA_MdIXxXWylu7EX4IEJLbUHo8inME'; //AHDRIOXA_BOT
    const BOT_TOKEN_PROD = '946776135:AAEnkdAvtbVs4vVtx0xflSunH7bXQTNoIVA'; //EZCachBot
    const TG_API_ID = '1076612';
    const TG_API_HASH = 'c5475322db4fe71e85e31e593cab02be';

    const CHANNELS = ['-1001488600170', '-1001147538491'];
    const CHANNELS_URL = [
        'https://t.me/joinchat/AAAAAFi6PGpSUNn2_i87rg',
        'https://t.me/joinchat/AAAAAERmDDt9FwHQc-UK8Q'
    ];
    const CHANNELS_NAME = ['ВРУБИ РУБИЛЬНИК', 'ИНФОРМАТОР'];

    const COMP_TABLE = 'ezcash_comp7';

    const ADMINS = [342799025, 377226192];

    const COUNT_SUBSCRIPTIONS = 2; // Число подписок

    const COUNT_SUBSCRIBERS = 1; // Число приглашенных подписчиков

    const NONICKNAME_MESSAGE = '🚨Кажется у тебя не установлен никнейм через @. Это легко можно сделать в настройках аккаунта.

Без этого никуда. Извини.';

    const WELCOME_MESSAGE = '❌Здесь ты не узнаешь ответов на тупые вопросы по типу: 5+5, сколько км от Земли до Луны или у кого из порноактеров самый длинный болт.

Меня создали для того, чтобы радовать тебя деньгами.

Каждую неделю, а может и чаще, в этом боте будут проводиться розыгрыши денег и ценных призов.

🤟🏻Никаких вложений, все бесплатно. Выполнил условия розыгрыша - жди окончания розыгрыша.

Генератором рандомных чисел будет выбираться победитель. Видео с выбором победителей и скринами выплат также будут на канале с отзывами.

Жми на кнопку «УСЛОВИЯ НЕДЕЛИ», выполни простые задания, ожидай результатов и получай ценные призы.

Все просто. Дерзай!';

    const SUCCESS_MESSAGE = '🍻Мои поздравления.

Ты все сделал правильно. Осталось только чуть-чуть подождать результатов.

Не скучай!)';

    const FAILED_MESSAGE = '❌Сори, ты ещё не доделал.

Все условия ты знаешь. Приступай.';

    const FRIENDCOMPLETE_MESSAGE = '🙏🏻Твой друг большой молодец.

А вот ты не подписался на нужные Каналы.

Проверь подписку и жми кнопку ниже👇🏻';

    const SUBSCRIBECOMPLETE_MESSAGE = '🚷Ты на все подписался, но твой друг так и не принял участие в розыгрыше.

Напомни ему, чтобы все было по-честному. Это важно.

Как только он это сделает - мы тебя уведомим.';

    const CONDITIONS_TEXT = "⏰ВОЗЬМИ СВОЁ!

На этой неделе у нас новые спонсоры и новые условия с крутыми призами.

3 простых условия. Подписываемся и приглашаем друга.

1️⃣ <a href = 'https://t.me/joinchat/AAAAAFi6PGpSUNn2_i87rg'>Вруби рубильник</a> - ваш покорный слуга.
2️⃣ <a href = 'https://t.me/joinchat/AAAAAERmDDt9FwHQc-UK8Q'>Информатор</a> - про другую сторону интернета.
3️⃣Приглашаем <b>одного</b> друга, который тоже будет участвовать в розыгрыше. Вот твоя реф ссылка:

🗝 {reflink}

Когда твой друг примет участие в розыгрыше, тебе придёт уведомления в бота. Тогда все условия будут выполнены.

✅Когда выполнишь все условия жми кнопку ниже «Я ПОДПИСАЛСЯ» и жди результатов розыгрыша.

3 приза по 3500 рублей + схема по пятерочке, которую вы так просили.

Участников пока немного, поэтому дерзайте. Итоги подведём в воскресенье 12 апреля.

Всех благ, обнял!)";

    const WAIT_RESULT_TEXT = "⏰На этой неделе участников больше не принимаем.

На следующей неделе сделаем анонс нового розыгрыша, чтобы ты не упустил свой шанс.";
}
