<?php

class Constants {

    const DB_SERVER = 'localhost';
    const DB_NAME = 'u0914239_default';
    const DB_USERNAME = 'u0914239_default';
    const DB_PASSWORD = '7iB!kC5f';

    const BOT_TOKEN_DEV = '443210917:AAEgqEA_MdIXxXWylu7EX4IEJLbUHo8inME'; //AHDRIOXA_BOT
    const BOT_TOKEN_PROD = '946776135:AAEnkdAvtbVs4vVtx0xflSunH7bXQTNoIVA'; //EZCachBot
    const TG_API_ID = '1076612';
    const TG_API_HASH = 'c5475322db4fe71e85e31e593cab02be';

    const CHANNELS = ['-1001488600170', '-1001147538491'];
    const CHANNELS_URL = ['t.me/joinchat/AAAAAFi6PGpSUNn2_i87rg', 't.me/joinchat/AAAAAERmDDt9FwHQc-UK8Q'];
    const CHANNELS_NAME = ['Вруби Рубильник', 'ИНФОРМАТОР'];

    const ADMINS = [342799025, 377226192];

    const COUNT_SUBSCRIPTIONS = 0;

    const WELCOME_MESSAGE = '❌Здесь ты не узнаешь ответов на тупые вопросы по типу: 5+5, сколько км от Земли до Луны или у кого из порноактеров самый длинный болт.

Меня создали для того, чтобы радовать тебя деньгами.

Каждую неделю, а может и чаще, в этом боте будут проводиться розыгрыши денег и ценных призов.

🤟🏻Никаких вложений, все бесплатно. Выполнил условия розыгрыша - жди окончания розыгрыша.

Генератором рандомных чисел будет выбираться победитель. Видео с выбором победителей и скринами выплат также будут на канале с отзывами.

Жми на кнопку «УСЛОВИЯ ЭТОЙ НЕДЕЛИ», выполни простые задания, ожидай результатов и получай ценные призы.

Все просто. Дерзай!';

    const CONDITIONS_TEXT = "💵Ты уже почти готов забрать главный приз!

На этот раз у нас два спонсора, которые проводят розыгрыш.

🚨Обязательное условие - подписка на спонсоров розыгрыша. Итоги будут подведены такого-то числа.

➡<a href=\"t.me/joinchat/AAAAAFi6PGpSUNn2_i87rg\">Вруби Рубильник</a> - ваш покорный слуга со схемами, темами и розыгрышами.

➡<a href=\"t.me/joinchat/AAAAAERmDDt9FwHQc-UK8Q\">ИНФОРМАТОР</a> - свежий глоток воздуха в теневухе, анонимность в сети, интервью, хакинг, СИ и тд.

😱В этот раз мы разыгрываем 15к рублей. 
3 победителя получат по пятерику прямо на банковский счёт.

Итоги подведём 26 января(вс) рано утром. 
До этого времени можете участвовать сами и звать друзей.

И помни - шанс есть у каждого. Удачи!

P.S. После подписки на спонсоров жми кнопку «Я ПОДПИСАЛСЯ», чтобы мы все проверили. Иначе ты в пролёте.";
}
