<?php

class Constants {

    const DB_SERVER = 'localhost';
    const DB_NAME = 'u0914239_default';
    const DB_USERNAME = 'u0914239_default';
    const DB_PASSWORD = '7iB!kC5f';

    const BOT_TOKEN_DEV = '443210917:AAEgqEA_MdIXxXWylu7EX4IEJLbUHo8inME'; //AHDRIOXA_BOT
    const BOT_TOKEN_PROD = '946776135:AAEnkdAvtbVs4vVtx0xflSunH7bXQTNoIVA'; //EZCachBot
    const TG_API_ID = '1076612';
    const TG_API_HASH = 'c5475322db4fe71e85e31e593cab02be';

    const CHANNELS = ['-1001488600170'];
    const CHANNELS_URL = ['https://t.me/joinchat/AAAAAFi6PGpSUNn2_i87rg'];
    const CHANNELS_NAME = ['Вруби Рубильник'];
    const COMP_TABLE = 'ezcash_comp3';

    const ADMINS = [342799025, 377226192];

    const COUNT_SUBSCRIPTIONS = 0;

    const WELCOME_MESSAGE = '❌Здесь ты не узнаешь ответов на тупые вопросы по типу: 5+5, сколько км от Земли до Луны или у кого из порноактеров самый длинный болт.

Меня создали для того, чтобы радовать тебя деньгами.

Каждую неделю, а может и чаще, в этом боте будут проводиться розыгрыши денег и ценных призов.

🤟🏻Никаких вложений, все бесплатно. Выполнил условия розыгрыша - жди окончания розыгрыша.

Генератором рандомных чисел будет выбираться победитель. Видео с выбором победителей и скринами выплат также будут на канале с отзывами.

Жми на кнопку «УСЛОВИЯ НЕДЕЛИ», выполни простые задания, ожидай результатов и получай ценные призы.

Все просто. Дерзай!';

    const CONDITIONS_TEXT = "🧦НОСОЧКИ И ВКУСНОСТИ ЗАКАЗЫВАЛИ?

На этой неделе у нас розыгрыш необычный. Не супер денежный, но очень душевный, вкусный и тёплый. Я же в Грузии был все таки.

⏰УСЛОВИЯ В СТУДИЮ.

1)Подписаться на <a href=\"https://vk.com/app5898182_-147863740\">ПОЛНЫЙ ПОЛЕЗНЯК</a> - тут я уведомлю своих ребят о новой, крутой штуке и дам небольшую плюшку.

2)Проверить подписку на канал <a href=\"https://t.me/joinchat/AAAAAFi6PGpSUNn2_i87rg\">ВРУБИ РУБИЛЬНИК</a> - если уже подписан, то большой респект и спасибо, что ты с нами.

😱ЧТО ПО ПРИЗАМ?

1)Носки с хинкалями на любой размер + 3к на карту.
2)Чурчхелла вкусная, сладкая, сочная + 2к на карту.
3)Доступ в приватку + 1к на карту.

Участников у нас обычно немного, поэтому шансы есть у каждого. Тем более условия максимально простые.

🔥Выполни два условия и жми на кнопку «Я ПОДПИСАЛСЯ» ниже. Итоги подведём 1 марта в воскресенье.

Всех обнял. Всем удачи! ";

    const WAIT_RESULT_TEXT = "⏰На этой неделе участников больше не принимаем.

На следующей неделе сделаем анонс нового розыгрыша, чтобы ты не упустил свой шанс.";
}
