<?php

class Constants {

    const DB_SERVER = 'localhost';
    const DB_NAME = 'u0914239_default';
    const DB_USERNAME = 'u0914239_default';
    const DB_PASSWORD = '7iB!kC5f';

    const BOT_TOKEN_DEV = '443210917:AAEgqEA_MdIXxXWylu7EX4IEJLbUHo8inME'; //AHDRIOXA_BOT
    const BOT_TOKEN_PROD = '946776135:AAEnkdAvtbVs4vVtx0xflSunH7bXQTNoIVA'; //EZCachBot
    const TG_API_ID = '1076612';
    const TG_API_HASH = 'c5475322db4fe71e85e31e593cab02be';

    const CHANNELS = ['yadevchannel', 'journeytop'];
    const COUNT_SUBSCRIPTIONS = 0;

    const WELCOME_MESSAGE = '❌Здесь ты не узнаешь ответов на тупые вопросы по типу: 5+5, сколько км от Земли до Луны или у кого из порноактеров самый длинный болт.
    
Меня создали для того, чтобы радовать тебя деньгами.

Каждую неделю, а может и чаще, в этом боте будут проводиться розыгрыши денег и ценных призов.

🤟🏻Никаких вложений, все бесплатно. Выполнил условия розыгрыша - жди окончания розыгрыша.

Генератором рандомным чисел будет выбираться победитель. Видео с выбором победителей и скринами выплат также будут прям здесь.

Жми на кнопку «УСЛОВИЯ ЭТОЙ НЕДЕЛИ», выполни простые задания, ожидай результатов и получай деньги.

Все просто. Дерзай!';

    const CONDITIONS_TEXT = "Привет! Подпишись на каналы {links} тогда ты сможешь учавствовать в розыграше! После того как подпишешься, жми 'Я ПОДПИСАЛСЯ', чтобы мы проверили и ты смог учавcтовать в розыгрыше!";
}
