<?php

class Constants {

    const DB_SERVER = 'localhost';
    const DB_NAME = 'u0914239_default';
    const DB_USERNAME = 'u0914239_default';
    const DB_PASSWORD = '7iB!kC5f';

    const BOT_TOKEN_DEV = '443210917:AAEgqEA_MdIXxXWylu7EX4IEJLbUHo8inME'; //AHDRIOXA_BOT
    const BOT_TOKEN_PROD = '946776135:AAEnkdAvtbVs4vVtx0xflSunH7bXQTNoIVA'; //EZCachBot
    const TG_API_ID = '1076612';
    const TG_API_HASH = 'c5475322db4fe71e85e31e593cab02be';

//    const CHANNELS = ['-1001488600170'];
//    const CHANNELS_URL = ['https://t.me/joinchat/AAAAAFi6PGpSUNn2_i87rg'];
//    const CHANNELS_NAME = ['Вруби Рубильник'];

    const CHANNELS = ['-1001403784046'];
    const CHANNELS_URL = ['t.me/joinchat/AAAAAFOsC26A03ismZHjzA'];
    const CHANNELS_NAME = ['ТРАХ БУКОВ'];

    const COMP_TABLE = 'ezcash_comp4';

    const ADMINS = [342799025, 377226192];

    const COUNT_SUBSCRIPTIONS = 0;

    const WELCOME_MESSAGE = '❌Здесь ты не узнаешь ответов на тупые вопросы по типу: 5+5, сколько км от Земли до Луны или у кого из порноактеров самый длинный болт.

Меня создали для того, чтобы радовать тебя деньгами.

Каждую неделю, а может и чаще, в этом боте будут проводиться розыгрыши денег и ценных призов.

🤟🏻Никаких вложений, все бесплатно. Выполнил условия розыгрыша - жди окончания розыгрыша.

Генератором рандомных чисел будет выбираться победитель. Видео с выбором победителей и скринами выплат также будут на канале с отзывами.

Жми на кнопку «УСЛОВИЯ НЕДЕЛИ», выполни простые задания, ожидай результатов и получай ценные призы.

Все просто. Дерзай!';

    const CONDITIONS_TEXT = "🔥РОЗЫГРЫШ В СТУДИЮ.

Всех дам задним числом поздравляю с 8 марта. Искренне желаю исполнения всех желаний.

УСЛОВИЯ РОЗЫГРЫША НА ЭТОЙ НЕДЕЛЕ:

1️⃣Поставить лайк и написать комментарий к <a href=\"https://vk.com/wall-147863740_7728\">ЭТОМУ</a> посту. Без репостов, все просто.

2️⃣Быть подписанным на <a href=\"https://t.me/joinchat/AAAAAFOsC26A03ismZHjzA\">ТРАХ БУКОВ</a>. Скоро там будет отчёт по результатам за 2 месяца.

Два простых условия. 3 главных приза: 6к на карту+секретный мануал, 5к+приватная схема, 4к+ключи к ВПН.

Участвуйте, пока условия максимально простые и немного народу.

🚨И помните, что у вас должен быть Ник в телеге через @ (сделать это можно в настройках). Иначе робот не поместит вас в таблицу.

Всем удачи, фарта и море счастья!";

    const WAIT_RESULT_TEXT = "⏰На этой неделе участников больше не принимаем.

На следующей неделе сделаем анонс нового розыгрыша, чтобы ты не упустил свой шанс.";
}
