<?php

class Constants {

    const DB_SERVER = 'localhost';
    const DB_NAME = 'u0914239_default';
    const DB_USERNAME = 'u0914239_default';
    const DB_PASSWORD = '7iB!kC5f';

    const BOT_TOKEN_DEV = '443210917:AAEgqEA_MdIXxXWylu7EX4IEJLbUHo8inME'; //AHDRIOXA_BOT
    const BOT_TOKEN_PROD = '946776135:AAEnkdAvtbVs4vVtx0xflSunH7bXQTNoIVA'; //EZCachBot
    const TG_API_ID = '1076612';
    const TG_API_HASH = 'c5475322db4fe71e85e31e593cab02be';

    const CHANNELS = ['-1001403784046', '-1001162694520'];
    const CHANNELS_URL = ['t.me/joinchat/AAAAAFOsC26A03ismZHjzA', 't.me/joinchat/AAAAAEVNT3gb-KleQyxPFQ'];
    const CHANNELS_NAME = ['ТРАХ БУКОВ', 'ПЛОХИЕ АРБИТРАЖНИКИ'];

    const ADMINS = [342799025, 377226192];

    const COUNT_SUBSCRIPTIONS = 0;

    const WELCOME_MESSAGE = '❌Здесь ты не узнаешь ответов на тупые вопросы по типу: 5+5, сколько км от Земли до Луны или у кого из порноактеров самый длинный болт.

Меня создали для того, чтобы радовать тебя деньгами.

Каждую неделю, а может и чаще, в этом боте будут проводиться розыгрыши денег и ценных призов.

🤟🏻Никаких вложений, все бесплатно. Выполнил условия розыгрыша - жди окончания розыгрыша.

Генератором рандомных чисел будет выбираться победитель. Видео с выбором победителей и скринами выплат также будут на канале с отзывами.

Жми на кнопку «УСЛОВИЯ ЭТОЙ НЕДЕЛИ», выполни простые задания, ожидай результатов и получай ценные призы.

Все просто. Дерзай!';

    const CONDITIONS_TEXT = "⚡НОВАЯ НЕДЕЛЯ - НОВЫЙ РОЗЫГРЫШ.

Всем привет, родные мои. Должны были разыгрывать 10к, но я добавил свои 5к, чтобы не понижать планку.

⏰УСЛОВИЯ НЕДЕЛИ:

➡<a href=\"https://t.me/joinchat/AAAAAFOsC26A03ismZHjzA\">ТРАХ БУКОВ</a> - наш небольшой проект по ставкам с грамотной статистикой и аналитикой.

➡<a href=\"https://t.me/joinchat/AAAAAEVNT3gb-KleQyxPFQ\">ПЛОХИЕ АРБИТРАЖНИКИ</a> - здесь ты найдёшь пошаговые мануалы, как выйти на 200к в месяц.

Для участия в конкурсе нужно подписаться на оба канала и нажать ниже кнопку «Я ПОДПИСАЛСЯ».

📌Будет 3 победителя по 5к. Переведу куда угодно, лишь бы на благие цели.

Итоги будут подведены в ВС(03.02.2020). Отзывы и видео розыгрыша будет в нашем канале с отзывами.

Всем удачи. Шанс есть у каждого! ";

    const WAIT_RESULT_TEXT = "⏰На этой неделе участников больше не принимаем.

На следующей неделе сделаем анонс нового розыгрыша, чтобы ты не упустил свой шанс.";
}
