<?php

class Constants {

    const DB_SERVER = 'localhost';
    const DB_NAME = 'u0914239_default';
    const DB_USERNAME = 'u0914239_default';
    const DB_PASSWORD = '7iB!kC5f';

    const BOT_TOKEN_DEV = '443210917:AAEgqEA_MdIXxXWylu7EX4IEJLbUHo8inME'; //AHDRIOXA_BOT
    const BOT_TOKEN_PROD = '946776135:AAEnkdAvtbVs4vVtx0xflSunH7bXQTNoIVA'; //EZCachBot
    const TG_API_ID = '1076612';
    const TG_API_HASH = 'c5475322db4fe71e85e31e593cab02be';

//    const CHANNELS = ['-1001488600170'];
//    const CHANNELS_URL = ['https://t.me/joinchat/AAAAAFi6PGpSUNn2_i87rg'];
//    const CHANNELS_NAME = ['Вруби Рубильник'];

    const CHANNELS = ['-1001124997660', '-1001245562169', '-1001199710064'];
    const CHANNELS_URL = [
        'https://t.me/joinchat/AAAAAEMOGhyp0D58GGTWuQ',
        'https://t.me/joinchat/AAAAAEo9xTkWC82-1bOT4Q',
        'https://t.me/joinchat/AAAAAEeCH3A9soE_5YbZhQ'
    ];
    const CHANNELS_NAME = ['СХЕМЫ ЗАРАБОТКА', 'ЩЕДРЫЙ КИТАЕЦ', 'Я ЖЕ НЕ БИЗНЕСМЕН'];

    const COMP_TABLE = 'ezcash_comp5';

    const ADMINS = [342799025, 377226192];

    const COUNT_SUBSCRIPTIONS = 0;

    const WELCOME_MESSAGE = '❌Здесь ты не узнаешь ответов на тупые вопросы по типу: 5+5, сколько км от Земли до Луны или у кого из порноактеров самый длинный болт.

Меня создали для того, чтобы радовать тебя деньгами.

Каждую неделю, а может и чаще, в этом боте будут проводиться розыгрыши денег и ценных призов.

🤟🏻Никаких вложений, все бесплатно. Выполнил условия розыгрыша - жди окончания розыгрыша.

Генератором рандомных чисел будет выбираться победитель. Видео с выбором победителей и скринами выплат также будут на канале с отзывами.

Жми на кнопку «УСЛОВИЯ НЕДЕЛИ», выполни простые задания, ожидай результатов и получай ценные призы.

Все просто. Дерзай!';

    const CONDITIONS_TEXT = "⏰ПОРА ДЕЙСТВОВАТЬ!

На этой неделе у нас новые спонсоры и новые условия.

Оформляем подписку на интересные каналы:

1️⃣ <a href=\"https://t.me/joinchat/AAAAAEMOGhyp0D58GGTWuQ\">СХЕМЫ ЗАРАБОТКА</a> - абузы, денежные темы и немного халявы.
2️⃣ <a href=\"https://t.me/joinchat/AAAAAEo9xTkWC82-1bOT4Q\">️⃣ЩЕДРЫЙ КИТАЕЦ</a> - кайфовые и необычные штуки с Алика по супер низким ценам.
3️⃣ <a href=\"https://t.me/joinchat/AAAAAEeCH3A9soE_5YbZhQ\">Я ЖЕ НЕ БИЗНЕСМЕН</a> - необычные новости из мира бизнеса и бесплатные схемы.

✅Подписываемся на 3 канала, жмём ниже кнопку «Я ПОДПИСАЛСЯ» и ждём результатов розыгрыша.

3 приза по 3к рублей на карту и ещё 3 плюшки в виде подписки на онлайн кинотеатры без рекламы.

Участников пока немного, поэтому дерзайте. Итоги подведём в воскресенье 22 марта.

Всех благ, обнял!)";

    const WAIT_RESULT_TEXT = "⏰На этой неделе участников больше не принимаем.

На следующей неделе сделаем анонс нового розыгрыша, чтобы ты не упустил свой шанс.";
}
